In [101]:
#Importa la libreria pandas
import pandas as pd

In [102]:
#Genera el dataframe 'base' a partir del fichero de excel
base=pd.read_excel('https://github.com/amebarek87/am1/blob/main/Inmuebles.xls?raw=true') 
#base=pd.read_excel('C:\\...')

In [103]:
#Muestra las primeras 5 lineas de nuestro dataframe 
base.head()

   ID Fecha Anuncio  Provincia  Superficie  Precio Venta Fecha Venta Vendedor
0   1    2017-01-01     Lleida         291        213390  2017-06-19   Carmen
1   2    2017-01-01     Girona         199        194542  2017-04-19    Pedro
2   3    2017-01-01     Girona          82         71241  2017-11-08  Joaquín
3   4    2017-01-02     Girona         285        181545  2017-04-27    Jesús
4   5    2017-01-02  Tarragona         152        113802  2017-07-10    María

In [104]:
#Agrega los datos de superficie segun provincia
superficie_total=base.groupby('Provincia',as_index=False).agg({'Superficie':'sum'})

In [105]:
#Agrega los datos de Precio de los inmuebles segun provincia
Precio_total=base.groupby('Provincia',as_index=False).agg({'Precio Venta':'sum'})

In [107]:
#Une la base superficie_total con la base Precio_total usando la variable 'Provincia'
base_nueva=superficie_total.merge(Precio_total)

In [108]:
#Genera una nueva variable promedio que es el resultado de la division de la variable 'Precio Total' y 'Superficie Total'
base_nueva['precio promedio']=base_nueva['Precio Venta']/base_nueva['Superficie']

In [109]:
base_nueva.head()

   Provincia  Superficie  Precio Venta  precio promedio
0  Barcelona      144198     101566762       704.356246
1     Girona      146126     104538894       715.402420
2     Lleida      133199      94815376       711.832491
3  Tarragona      144610     100335094       693.832335

In [110]:
base_nueva.drop(columns=['Superficie','Precio Venta'], inplace=True) #Elimina las variables 'Superficie' y 'Precio Venta'

In [111]:
base_nueva.head()

   Provincia  precio promedio
0  Barcelona       704.356246
1     Girona       715.402420
2     Lleida       711.832491
3  Tarragona       693.832335

In [113]:
base_final=base.merge(base_nueva) #Une los datos de 'Base' con 'Base_nueva' usando la variable 'Provincia'

In [114]:
base_final.head()

,ID,Fecha Anuncio,Provincia,Superficie,Precio Venta,Fecha Venta,Vendedor,precio promedio
0,1,2017-01-01,Lleida,291,213390,2017-06-19,Carmen,711.832491
1,9,2017-01-04,Lleida,108,102438,2017-12-28,Jesús,711.832491
2,10,2017-01-04,Lleida,299,204276,2017-10-06,Joaquín,711.832491
3,22,2017-01-09,Lleida,116,72755,2017-04-14,Pedro,711.832491
4,46,2017-01-20,Lleida,224,129404,2017-10-29,Carmen,711.832491

In [117]:
base_final['precio por m2']=base_final['Precio Venta']/base_final['Superficie'] # genera una nueva variable

In [118]:
base_final.head()

,ID,Fecha Anuncio,Provincia,Superficie,Precio Venta,Fecha Venta,Vendedor,precio promedio,precio por m2
0,1,2017-01-01,Lleida,291,213390,2017-06-19,Carmen,711.832491,733.298969
1,9,2017-01-04,Lleida,108,102438,2017-12-28,Jesús,711.832491,948.500000
2,10,2017-01-04,Lleida,299,204276,2017-10-06,Joaquín,711.832491,683.197324
3,22,2017-01-09,Lleida,116,72755,2017-04-14,Pedro,711.832491,627.198276
4,46,2017-01-20,Lleida,224,129404,2017-10-29,Carmen,711.832491,577.696429

In [121]:
#filtra los datos segun las condiciones especificadas
base_final.loc[(base_final['Provincia']=='Barcelona') & (base_final['precio por m2']<base_final['precio promedio'])]

,ID,Fecha Anuncio,Provincia,Superficie,Precio Venta,Fecha Venta,Vendedor,precio promedio,precio por m2
2501,18,2017-01-06,Barcelona,283,167960,2017-06-06,Carmen,704.356246,593.498233
2509,41,2017-01-18,Barcelona,230,142186,2017-09-23,Jesús,704.356246,618.200000
2511,47,2017-01-20,Barcelona,53,24941,2017-08-11,Luisa,704.356246,470.584906
2512,48,2017-01-20,Barcelona,284,145748,2017-07-06,Jesús,704.356246,513.197183
2514,63,2017-01-25,Barcelona,144,73814,2017-09-06,Luisa,704.356246,512.597222
...,...,...,...,...,...,...,...,...,...
3331,3324,2020-04-24,Barcelona,136,80743,NaT,NaN,704.356246,593.698529
3332,3326,2020-04-25,Barcelona,296,207821,NaT,NaN,704.356246,702.097973
3333,3327,2020-04-25,Barcelona,161,99900,NaT,NaN,704.356246,620.496894
3335,3330,2020-04-27,Barcelona,88,61256,NaT,NaN,704.356246,696.090909
3336,3336,2020-04-30,Barcelona,88,39740,NaT,NaN,704.356246,451.590909

In [122]:
#Se guarda la base filtrada en un nuevo dataframe
base_excel=base_final.loc[(base_final['Provincia']=='Barcelona') & (base_final['precio por m2']<base_final['precio promedio'])]

In [123]:
#se pasa el dataframe a un ficher excel 
base_excel.to_excel(r'C:\Users\dc_an\videos\export_dataframe.xlsx', index = False, header=True)